tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Count lines of code quickly
brew "loc"
# Text-based web browser
brew "lynx"
# Perl compatible regular expressions library
brew "pcre", link: false
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Platform built on V8 to build network applications
brew "node@10", link: true
# Command-line interface for SQLite
brew "sqlite"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
