tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Asynchronous DNS library
brew "c-ares"
# Mozilla CA certificate store
brew "ca-certificates"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Count lines of code quickly
brew "loc"
# Mac App Store command-line interface
brew "mas"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Perl compatible regular expressions library
brew "pcre"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Platform built on V8 to build network applications
brew "node@14", link: true
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Linter for prose
brew "proselint"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Text interface for Git repositories
brew "tig"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# Two-factor authentication software
cask "authy"
# Scriptable scratchpad for developers
cask "boop"
# Desktop automation application
cask "hammerspoon"
# Modern and intuitive HTTP Debugging Proxy app
cask "proxyman"
# Open-source code editor
cask "visual-studio-code"

#mas "Apple Configurator 2", id: 1037126344
mas "Calca", id: 635758264
mas "Day One", id: 1055511498
#mas "Fantastical", id: 975937182
mas "GIF Brewery 3", id: 1081413713
#mas "Gifski", id: 1351639930
mas "Hush", id: 1544743900
#mas "Keynote", id: 409183694
#mas "Markoff", id: 1084713122
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
mas "PCalc", id: 403504866
mas "PhotoSweeper", id: 463362050
mas "Pins", id: 1547106997
#mas "Playgrounds", id: 1496833156
mas "Reeder", id: 1449412482
mas "Remote Desktop", id: 409907375
mas "Slack", id: 803453959
#mas "Xcode", id: 497799835


# 1password
# chrome
# daisydisk
# firefox
# knockknock
# pixelsnap
# script-debugger
# vmware-fusion
# xscope
